benchmark/results/throughput_mc-vs-rust/RAW/flare-plaintext-throughput_mc-run5.txt
Running 30s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread calibration: mean lat.: 1.097ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.119ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.096ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.200ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.089ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.112ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.201ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.171ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.14ms  508.12us   4.90ms   65.61%
    Req/Sec     6.65k   554.56    10.22k    81.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.12ms
 75.000%    1.49ms
 90.000%    1.82ms
 99.000%    2.36ms
 99.900%    2.78ms
 99.990%    3.18ms
 99.999%    3.85ms
100.000%    4.90ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.034     0.000000            1         1.00
       0.472     0.100000       100425         1.11
       0.676     0.200000       200833         1.25
       0.837     0.300000       300539         1.43
       0.981     0.400000       401190         1.67
       1.118     0.500000       500998         2.00
       1.187     0.550000       551072         2.22
       1.258     0.600000       601261         2.50
       1.332     0.650000       651507         2.86
       1.409     0.700000       701004         3.33
       1.493     0.750000       751253         4.00
       1.538     0.775000       776302         4.44
       1.585     0.800000       801259         5.00
       1.636     0.825000       826542         5.71
       1.689     0.850000       851240         6.67
       1.748     0.875000       876257         8.00
       1.781     0.887500       888940         8.89
       1.816     0.900000       901492        10.00
       1.854     0.912500       913982        11.43
       1.896     0.925000       926500        13.33
       1.943     0.937500       939044        16.00
       1.969     0.943750       945143        17.78
       1.998     0.950000       951445        20.00
       2.030     0.956250       957646        22.86
       2.067     0.962500       964034        26.67
       2.109     0.968750       970155        32.00
       2.135     0.971875       973503        35.56
       2.161     0.975000       976522        40.00
       2.191     0.978125       979681        45.71
       2.225     0.981250       982823        53.33
       2.265     0.984375       985874        64.00
       2.287     0.985938       987435        71.11
       2.313     0.987500       989037        80.00
       2.339     0.989062       990508        91.43
       2.369     0.990625       992072       106.67
       2.405     0.992188       993650       128.00
       2.425     0.992969       994420       142.22
       2.449     0.993750       995193       160.00
       2.475     0.994531       996007       182.86
       2.503     0.995313       996777       213.33
       2.535     0.996094       997537       256.00
       2.555     0.996484       997913       284.44
       2.577     0.996875       998331       320.00
       2.599     0.997266       998700       365.71
       2.627     0.997656       999086       426.67
       2.659     0.998047       999500       512.00
       2.675     0.998242       999686       568.89
       2.697     0.998437       999888       640.00
       2.721     0.998633      1000072       731.43
       2.747     0.998828      1000263       853.33
       2.779     0.999023      1000458      1024.00
       2.799     0.999121      1000555      1137.78
       2.821     0.999219      1000661      1280.00
       2.841     0.999316      1000758      1462.86
       2.871     0.999414      1000852      1706.67
       2.903     0.999512      1000947      2048.00
       2.919     0.999561      1000998      2275.56
       2.939     0.999609      1001042      2560.00
       2.961     0.999658      1001092      2925.71
       2.993     0.999707      1001140      3413.33
       3.025     0.999756      1001191      4096.00
       3.043     0.999780      1001215      4551.11
       3.075     0.999805      1001238      5120.00
       3.091     0.999829      1001263      5851.43
       3.117     0.999854      1001290      6826.67
       3.141     0.999878      1001314      8192.00
       3.153     0.999890      1001327      9102.22
       3.187     0.999902      1001337     10240.00
       3.209     0.999915      1001349     11702.86
       3.257     0.999927      1001360     13653.33
       3.341     0.999939      1001372     16384.00
       3.373     0.999945      1001378     18204.44
       3.397     0.999951      1001386     20480.00
       3.419     0.999957      1001391     23405.71
       3.479     0.999963      1001398     27306.67
       3.529     0.999969      1001403     32768.00
       3.541     0.999973      1001408     36408.89
       3.553     0.999976      1001409     40960.00
       3.561     0.999979      1001412     46811.43
       3.597     0.999982      1001415     54613.33
       3.671     0.999985      1001418     65536.00
       3.747     0.999986      1001420     72817.78
       3.789     0.999988      1001421     81920.00
       3.851     0.999989      1001423     93622.86
       3.943     0.999991      1001424    109226.67
       4.059     0.999992      1001426    131072.00
       4.073     0.999993      1001427    145635.56
       4.073     0.999994      1001427    163840.00
       4.099     0.999995      1001428    187245.71
       4.107     0.999995      1001429    218453.33
       4.379     0.999996      1001430    262144.00
       4.379     0.999997      1001430    291271.11
       4.379     0.999997      1001430    327680.00
       4.423     0.999997      1001431    374491.43
       4.423     0.999998      1001431    436906.67
       4.427     0.999998      1001432    524288.00
       4.427     0.999998      1001432    582542.22
       4.427     0.999998      1001432    655360.00
       4.427     0.999999      1001432    748982.86
       4.427     0.999999      1001432    873813.33
       4.899     0.999999      1001433   1048576.00
       4.899     1.000000      1001433          inf
#[Mean    =        1.139, StdDeviation   =        0.508]
#[Max     =        4.896, Total count    =      1001433]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1498741 requests in 30.00s, 167.23MB read
Requests/sec:  49957.75
Transfer/sec:      5.57MB