benchmark/results/throughput_mc-vs-rust/RAW/flare_mc-plaintext-throughput_mc-cal-162472.txt
Running 10s test @ http://127.0.0.1:8080/plaintext
  8 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.92ms  148.03ms 500.99ms   81.14%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%  164.74ms
 90.000%  370.17ms
 99.000%  480.51ms
 99.900%  496.13ms
 99.990%  499.71ms
 99.999%  500.48ms
100.000%  501.25ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.038     0.000000            1         1.00
       0.362     0.100000       158772         1.11
       0.559     0.200000       316603         1.25
       0.759     0.300000       475169         1.43
       0.932     0.400000       632604         1.67
       1.113     0.500000       790982         2.00
       1.233     0.550000       869826         2.22
       1.438     0.600000       948719         2.50
      32.959     0.650000      1027739         2.86
      94.207     0.700000      1106855         3.33
     164.735     0.750000      1185977         4.00
     195.967     0.775000      1225522         4.44
     223.999     0.800000      1265052         5.00
     260.479     0.825000      1304554         5.71
     296.191     0.850000      1344193         6.67
     332.543     0.875000      1383724         8.00
     351.999     0.887500      1403425         8.89
     370.175     0.900000      1423238        10.00
     385.535     0.912500      1442900        11.43
     400.127     0.925000      1462806        13.33
     414.207     0.937500      1482613        16.00
     420.863     0.943750      1492200        17.78
     427.007     0.950000      1502182        20.00
     434.175     0.956250      1511980        22.86
     442.111     0.962500      1521907        26.67
     450.303     0.968750      1531987        32.00
     454.143     0.971875      1536875        35.56
     458.239     0.975000      1541729        40.00
     462.591     0.978125      1546713        45.71
     466.431     0.981250      1551521        53.33
     470.783     0.984375      1556587        64.00
     473.087     0.985938      1558940        71.11
     475.903     0.987500      1561459        80.00
     478.719     0.989062      1563937        91.43
     481.535     0.990625      1566458       106.67
     484.351     0.992188      1568913       128.00
     485.631     0.992969      1570110       142.22
     486.911     0.993750      1571327       160.00
     488.191     0.994531      1572493       182.86
     489.727     0.995313      1573919       213.33
     491.007     0.996094      1575158       256.00
     491.519     0.996484      1575664       284.44
     492.287     0.996875      1576410       320.00
     492.799     0.997266      1576884       365.71
     493.567     0.997656      1577608       426.67
     494.079     0.998047      1578047       512.00
     494.591     0.998242      1578476       568.89
     494.847     0.998437      1578680       640.00
     495.359     0.998633      1579039       731.43
     495.871     0.998828      1579395       853.33
     496.383     0.999023      1579712      1024.00
     496.639     0.999121      1579841      1137.78
     496.895     0.999219      1579969      1280.00
     497.151     0.999316      1580099      1462.86
     497.407     0.999414      1580226      1706.67
     497.919     0.999512      1580477      2048.00
     497.919     0.999561      1580477      2275.56
     498.175     0.999609      1580579      2560.00
     498.431     0.999658      1580667      2925.71
     498.687     0.999707      1580744      3413.33
     498.943     0.999756      1580818      4096.00
     498.943     0.999780      1580818      4551.11
     499.199     0.999805      1580893      5120.00
     499.199     0.999829      1580893      5851.43
     499.455     0.999854      1580968      6826.67
     499.455     0.999878      1580968      8192.00
     499.455     0.999890      1580968      9102.22
     499.711     0.999902      1581031     10240.00
     499.711     0.999915      1581031     11702.86
     499.711     0.999927      1581031     13653.33
     499.967     0.999939      1581074     16384.00
     499.967     0.999945      1581074     18204.44
     499.967     0.999951      1581074     20480.00
     499.967     0.999957      1581074     23405.71
     500.223     0.999963      1581104     27306.67
     500.223     0.999969      1581104     32768.00
     500.223     0.999973      1581104     36408.89
     500.223     0.999976      1581104     40960.00
     500.223     0.999979      1581104     46811.43
     500.479     0.999982      1581118     54613.33
     500.479     0.999985      1581118     65536.00
     500.479     0.999986      1581118     72817.78
     500.479     0.999988      1581118     81920.00
     500.479     0.999989      1581118     93622.86
     500.735     0.999991      1581127    109226.67
     500.735     0.999992      1581127    131072.00
     500.735     0.999993      1581127    145635.56
     500.735     0.999994      1581127    163840.00
     500.735     0.999995      1581127    187245.71
     500.735     0.999995      1581127    218453.33
     500.735     0.999996      1581127    262144.00
     500.991     0.999997      1581130    291271.11
     500.991     0.999997      1581130    327680.00
     500.991     0.999997      1581130    374491.43
     500.991     0.999998      1581130    436906.67
     500.991     0.999998      1581130    524288.00
     501.247     0.999998      1581133    582542.22
     501.247     1.000000      1581133          inf
#[Mean    =       92.915, StdDeviation   =      148.031]
#[Max     =      500.992, Total count    =      1581133]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1581156 requests in 10.00s, 176.43MB read
Requests/sec: 158122.35
Transfer/sec:     17.64MB